
## Plan Result (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/21430)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-01-23T19:00:37Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:1oyn6teaa0/" -> (known after apply)
      ~ id            = "1f0ang" -> (known after apply)
      ~ invoke_url    = "https://1oyn6teaa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1706036381816" -> "1706036991994"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "1f0ang" -> (known after apply)
        id                    = "ags-1oyn6teaa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 900, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│  900:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 900, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
  900:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"d80b3be0-65d3-4273-8aaa-ebfc23290e5b","JobName":"sendgrid-data_infrastructure_plan_prod","PRNumber":92,"Program":"tfcmt","SHA1":"e7360058499d8d0fb48708a370a2ea2d4ea27b59","Target":"sendgrid-data-cdk","Vars":{}} -->